social_net/evaluations/latency_compare/data/202404271018_100_1m.txt
Running 1m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read
  2 threads and 100 connections

  Thread calibration: mean lat.: 437.580ms, rate sampling interval: 1397ms
  Thread calibration: mean lat.: 456.635ms, rate sampling interval: 1438ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/home-timeline/read 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.01s     3.43s   14.67s    83.74%
    Req/Sec    52.14     17.92    94.00     65.22%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  271.10ms
 75.000%    1.68s 
 90.000%    7.86s 
 99.000%   14.67s 
 99.900%   18.89s 
 99.990%   21.05s 
 99.999%   21.84s 
100.000%   21.84s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

      28.799     0.000000            1         1.00
     235.007     0.100000          529         1.11
     244.351     0.200000         1066         1.25
     252.031     0.300000         1590         1.43
     260.351     0.400000         2113         1.67
     271.103     0.500000         2640         2.00
     279.807     0.550000         2903         2.22
     298.751     0.600000         3160         2.50
     429.311     0.650000         3425         2.86
     493.823     0.700000         3687         3.33
    1679.359     0.750000         3951         4.00
    2897.919     0.775000         4082         4.44
    3917.823     0.800000         4214         5.00
    4833.279     0.825000         4346         5.71
    5885.951     0.850000         4477         6.67
    6922.239     0.875000         4608         8.00
    7262.207     0.887500         4674         8.89
    7856.127     0.900000         4740        10.00
    8462.335     0.912500         4807        11.43
    8732.671     0.925000         4873        13.33
    9281.535     0.937500         4940        16.00
    9445.375     0.943750         4970        17.78
    9592.831     0.950000         5003        20.00
   10035.199     0.956250         5048        22.86
   10043.391     0.962500         5085        26.67
   10051.583     0.968750         5103        32.00
   10125.311     0.971875         5118        35.56
   10657.791     0.975000         5135        40.00
   11419.647     0.978125         5151        45.71
   12189.695     0.981250         5168        53.33
   12951.551     0.984375         5184        64.00
   13533.183     0.985938         5192        71.11
   13803.519     0.987500         5201        80.00
   14467.071     0.989062         5209        91.43
   15122.431     0.990625         5217       106.67
   15720.447     0.992188         5225       128.00
   15966.207     0.992969         5229       142.22
   16162.815     0.993750         5234       160.00
   16695.295     0.994531         5238       182.86
   16908.287     0.995313         5242       213.33
   17481.727     0.996094         5246       256.00
   17547.263     0.996484         5249       284.44
   17563.647     0.996875         5250       320.00
   17727.487     0.997266         5252       365.71
   18055.167     0.997656         5254       426.67
   18268.159     0.998047         5256       512.00
   18284.543     0.998242         5257       568.89
   18317.311     0.998437         5258       640.00
   18350.079     0.998633         5259       731.43
   18530.303     0.998828         5260       853.33
   18890.751     0.999023         5261      1024.00
   19054.591     0.999121         5262      1137.78
   19054.591     0.999219         5262      1280.00
   19644.415     0.999316         5263      1462.86
   19644.415     0.999414         5263      1706.67
   20414.463     0.999512         5264      2048.00
   20414.463     0.999561         5264      2275.56
   20414.463     0.999609         5264      2560.00
   21053.439     0.999658         5265      2925.71
   21053.439     0.999707         5265      3413.33
   21053.439     0.999756         5265      4096.00
   21053.439     0.999780         5265      4551.11
   21053.439     0.999805         5265      5120.00
   21839.871     0.999829         5266      5851.43
   21839.871     1.000000         5266          inf
#[Mean    =     2012.039, StdDeviation   =     3430.409]
#[Max     =    21823.488, Total count    =         5266]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  5836 requests in 1.00m, 1.60MB read
  Non-2xx or 3xx responses: 127
Requests/sec:     97.18  
Transfer/sec:     27.20KB